Revit 2024 API
DocumentSaveToLocalProgressChangedEventArgs.TotalStreams Property
 The total expected number of streams to save to local.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public int TotalStreams { get; }
Visual Basic
Public ReadOnly Property TotalStreams As Integer
	Get
Visual C++
public:
property int TotalStreams {
	int get ();
}
See Also
DocumentSaveToLocalProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace